7767517
168 200
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 9=1
Pooling                  maxpool2d_74             1 1 1 2 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Split                    splitncnn_0              1 2 2 3 4
ConvolutionDepthWise     convdw_121               1 1 4 5 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=288 7=32
Convolution              convrelu_1               1 1 3 6 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1920 9=1
ConvolutionDepthWise     convdw_122               1 1 6 7 0=60 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=540 7=60
Convolution              convrelu_3               1 1 5 8 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1920 9=1
Convolution              convrelu_2               1 1 7 9 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3600 9=1
Concat                   cat_0                    2 1 8 9 10 0=0
ShuffleChannel           channelshuffle_14        1 1 10 11 0=2 1=0
Slice                    chunk_0                  1 2 11 12 13 -23300=2,-233,-233 1=0
Convolution              convrelu_4               1 1 13 14 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3600 9=1
ConvolutionDepthWise     convdw_123               1 1 14 15 0=60 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=540 7=60
Convolution              convrelu_5               1 1 15 16 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3600 9=1
Concat                   cat_1                    2 1 12 16 17 0=0
ShuffleChannel           channelshuffle_15        1 1 17 18 0=2 1=0
Slice                    chunk_1                  1 2 18 19 20 -23300=2,-233,-233 1=0
Convolution              convrelu_6               1 1 20 21 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3600 9=1
ConvolutionDepthWise     convdw_124               1 1 21 22 0=60 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=540 7=60
Convolution              convrelu_7               1 1 22 23 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3600 9=1
Concat                   cat_2                    2 1 19 23 24 0=0
ShuffleChannel           channelshuffle_16        1 1 24 25 0=2 1=0
Slice                    chunk_2                  1 2 25 26 27 -23300=2,-233,-233 1=0
Convolution              convrelu_8               1 1 27 28 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3600 9=1
ConvolutionDepthWise     convdw_125               1 1 28 29 0=60 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=540 7=60
Convolution              convrelu_9               1 1 29 30 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3600 9=1
Concat                   cat_3                    2 1 26 30 31 0=0
ShuffleChannel           channelshuffle_17        1 1 31 32 0=2 1=0
Split                    splitncnn_1              1 3 32 33 34 35
ConvolutionDepthWise     convdw_126               1 1 35 36 0=120 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1080 7=120
Convolution              convrelu_10              1 1 34 37 0=116 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13920 9=1
ConvolutionDepthWise     convdw_127               1 1 37 38 0=116 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1044 7=116
Convolution              convrelu_12              1 1 36 39 0=116 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13920 9=1
Convolution              convrelu_11              1 1 38 40 0=116 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=1
Concat                   cat_4                    2 1 39 40 41 0=0
ShuffleChannel           channelshuffle_18        1 1 41 42 0=2 1=0
Slice                    chunk_3                  1 2 42 43 44 -23300=2,-233,-233 1=0
Convolution              convrelu_13              1 1 44 45 0=116 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=1
ConvolutionDepthWise     convdw_128               1 1 45 46 0=116 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1044 7=116
Convolution              convrelu_14              1 1 46 47 0=116 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=1
Concat                   cat_5                    2 1 43 47 48 0=0
ShuffleChannel           channelshuffle_19        1 1 48 49 0=2 1=0
Slice                    chunk_4                  1 2 49 50 51 -23300=2,-233,-233 1=0
Convolution              convrelu_15              1 1 51 52 0=116 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=1
ConvolutionDepthWise     convdw_129               1 1 52 53 0=116 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1044 7=116
Convolution              convrelu_16              1 1 53 54 0=116 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=1
Concat                   cat_6                    2 1 50 54 55 0=0
ShuffleChannel           channelshuffle_20        1 1 55 56 0=2 1=0
Slice                    chunk_5                  1 2 56 57 58 -23300=2,-233,-233 1=0
Convolution              convrelu_17              1 1 58 59 0=116 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=1
ConvolutionDepthWise     convdw_130               1 1 59 60 0=116 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1044 7=116
Convolution              convrelu_18              1 1 60 61 0=116 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=1
Concat                   cat_7                    2 1 57 61 62 0=0
ShuffleChannel           channelshuffle_21        1 1 62 63 0=2 1=0
Slice                    chunk_6                  1 2 63 64 65 -23300=2,-233,-233 1=0
Convolution              convrelu_19              1 1 65 66 0=116 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=1
ConvolutionDepthWise     convdw_131               1 1 66 67 0=116 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1044 7=116
Convolution              convrelu_20              1 1 67 68 0=116 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=1
Concat                   cat_8                    2 1 64 68 69 0=0
ShuffleChannel           channelshuffle_22        1 1 69 70 0=2 1=0
Slice                    chunk_7                  1 2 70 71 72 -23300=2,-233,-233 1=0
Convolution              convrelu_21              1 1 72 73 0=116 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=1
ConvolutionDepthWise     convdw_132               1 1 73 74 0=116 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1044 7=116
Convolution              convrelu_22              1 1 74 75 0=116 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=1
Concat                   cat_9                    2 1 71 75 76 0=0
ShuffleChannel           channelshuffle_23        1 1 76 77 0=2 1=0
Slice                    chunk_8                  1 2 77 78 79 -23300=2,-233,-233 1=0
Convolution              convrelu_23              1 1 79 80 0=116 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=1
ConvolutionDepthWise     convdw_133               1 1 80 81 0=116 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1044 7=116
Convolution              convrelu_24              1 1 81 82 0=116 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=1
Concat                   cat_10                   2 1 78 82 83 0=0
ShuffleChannel           channelshuffle_24        1 1 83 84 0=2 1=0
Slice                    chunk_9                  1 2 84 85 86 -23300=2,-233,-233 1=0
Convolution              convrelu_25              1 1 86 87 0=116 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=1
ConvolutionDepthWise     convdw_134               1 1 87 88 0=116 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1044 7=116
Convolution              convrelu_26              1 1 88 89 0=116 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13456 9=1
Concat                   cat_11                   2 1 85 89 90 0=0
ShuffleChannel           channelshuffle_25        1 1 90 91 0=2 1=0
Split                    splitncnn_2              1 3 91 92 93 94
ConvolutionDepthWise     convdw_135               1 1 94 95 0=232 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2088 7=232
Convolution              convrelu_27              1 1 93 96 0=232 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=53824 9=1
ConvolutionDepthWise     convdw_136               1 1 96 97 0=232 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2088 7=232
Convolution              convrelu_29              1 1 95 98 0=232 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=53824 9=1
Convolution              convrelu_28              1 1 97 99 0=232 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=53824 9=1
Concat                   cat_12                   2 1 98 99 100 0=0
ShuffleChannel           channelshuffle_26        1 1 100 101 0=2 1=0
Slice                    chunk_10                 1 2 101 102 103 -23300=2,-233,-233 1=0
Convolution              convrelu_30              1 1 103 104 0=232 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=53824 9=1
ConvolutionDepthWise     convdw_137               1 1 104 105 0=232 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2088 7=232
Convolution              convrelu_31              1 1 105 106 0=232 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=53824 9=1
Concat                   cat_13                   2 1 102 106 107 0=0
ShuffleChannel           channelshuffle_27        1 1 107 108 0=2 1=0
Convolution              conv_60                  1 1 108 109 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=44544
Swish                    silu_12                  1 1 109 110
Split                    splitncnn_3              1 2 110 111 112
Interp                   upsample_110             1 1 112 113 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_14                   2 1 113 92 114 0=0
ConvolutionDepthWise     convdwrelu_0             1 1 114 115 0=328 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2952 7=328 9=1
Convolution              convrelu_32              1 1 115 116 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=31488 9=1
Convolution              conv_62                  1 1 116 117 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_13                  1 1 117 118
Split                    splitncnn_4              1 2 118 119 120
Interp                   upsample_111             1 1 120 121 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_15                   2 1 121 33 122 0=0
ConvolutionDepthWise     convdwrelu_1             1 1 122 123 0=216 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1944 7=216 9=1
Convolution              convrelu_33              1 1 123 124 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=20736 9=1
Split                    splitncnn_5              1 3 124 125 126 127
ConvolutionDepthWise     convdwrelu_2             1 1 127 128 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 7=96 9=1
Convolution              convrelu_34              1 1 128 129 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
BinaryOp                 add_0                    2 1 129 119 130 0=0
ConvolutionDepthWise     convdwrelu_3             1 1 130 131 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=1
Convolution              convrelu_35              1 1 131 132 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Split                    splitncnn_6              1 3 132 133 134 135
ConvolutionDepthWise     convdwrelu_4             1 1 135 136 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 7=96 9=1
Convolution              convrelu_36              1 1 136 137 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
BinaryOp                 add_1                    2 1 137 111 138 0=0
Split                    splitncnn_7              1 3 126 139 140 141
Reduction                mean_115                 1 1 141 142 0=3 1=0 -23303=2,1,2 4=1 5=1
BinaryOp                 sub_2                    2 1 139 142 143 0=1
UnaryOp                  pow_3                    1 1 143 144 0=4
Split                    splitncnn_8              1 2 144 145 146
Reduction                sum_118                  1 1 146 147 0=0 1=0 -23303=2,1,2 4=1 5=1
BinaryOp                 div_4                    1 1 147 148 0=3 1=1 2=6.399000e+03
BinaryOp                 add_5                    1 1 148 149 0=0 1=1 2=1.000000e-04
BinaryOp                 mul_6                    1 1 149 150 0=2 1=1 2=4.000000e+00
BinaryOp                 div_7                    2 1 145 150 151 0=3
BinaryOp                 add_8                    1 1 151 152 0=0 1=1 2=5.000000e-01
Sigmoid                  sigmoid_107              1 1 152 153
BinaryOp                 mul_9                    2 1 140 153 154 0=2
Split                    splitncnn_9              1 3 134 155 156 157
Reduction                mean_116                 1 1 157 158 0=3 1=0 -23303=2,1,2 4=1 5=1
BinaryOp                 sub_10                   2 1 155 158 159 0=1
UnaryOp                  pow_11                   1 1 159 160 0=4
Split                    splitncnn_10             1 2 160 161 162
Reduction                sum_119                  1 1 162 163 0=0 1=0 -23303=2,1,2 4=1 5=1
BinaryOp                 div_12                   1 1 163 164 0=3 1=1 2=1.599000e+03
BinaryOp                 add_13                   1 1 164 165 0=0 1=1 2=1.000000e-04
BinaryOp                 mul_14                   1 1 165 166 0=2 1=1 2=4.000000e+00
BinaryOp                 div_15                   2 1 161 166 167 0=3
BinaryOp                 add_16                   1 1 167 168 0=0 1=1 2=5.000000e-01
Sigmoid                  sigmoid_108              1 1 168 169
BinaryOp                 mul_17                   2 1 156 169 170 0=2
ConvolutionDepthWise     convdwrelu_5             1 1 138 171 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=1
Convolution              convrelu_37              1 1 171 172 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Split                    splitncnn_11             1 2 172 173 174
Split                    splitncnn_12             1 3 174 175 176 177
Reduction                mean_117                 1 1 177 178 0=3 1=0 -23303=2,1,2 4=1 5=1
BinaryOp                 sub_18                   2 1 175 178 179 0=1
UnaryOp                  pow_19                   1 1 179 180 0=4
Split                    splitncnn_13             1 2 180 181 182
Reduction                sum_120                  1 1 182 183 0=0 1=0 -23303=2,1,2 4=1 5=1
BinaryOp                 div_20                   1 1 183 184 0=3 1=1 2=3.990000e+02
BinaryOp                 add_21                   1 1 184 185 0=0 1=1 2=1.000000e-04
BinaryOp                 mul_22                   1 1 185 186 0=2 1=1 2=4.000000e+00
BinaryOp                 div_23                   2 1 181 186 187 0=3
BinaryOp                 add_24                   1 1 187 188 0=0 1=1 2=5.000000e-01
Sigmoid                  sigmoid_109              1 1 188 189
BinaryOp                 mul_25                   2 1 176 189 190 0=2
Convolution              conv_73                  1 1 190 191 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=288
Convolution              conv_72                  1 1 173 192 0=18 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1728
Concat                   cat_16                   2 1 192 191 out2 0=0
Convolution              conv_70                  1 1 170 194 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=288
Convolution              conv_69                  1 1 133 195 0=18 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1728
Concat                   cat_17                   2 1 195 194 out1 0=0
Convolution              conv_68                  1 1 154 197 0=3 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=288
Convolution              conv_67                  1 1 125 198 0=18 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1728
Concat                   cat_18                   2 1 198 197 out0 0=0
